tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# --- Dev CLIs ---
brew "starship"
brew "asdf"
brew "neovim"
brew "awscli"
brew "git"
brew "wget"
brew "fd"
brew "ripgrep"
brew "fzf"
brew "jq"
brew "yq"
brew "tree"
brew "openssl@3"
brew "readline"
brew "libpq"

# --- Apps ---
cask "iterm2"
cask "docker"
cask "visual-studio-code"

# Browsers
cask "google-chrome"
cask "firefox"

# Security
cask "lulu"
cask "1password"
cask "clearvpn"

# Social / comms / media
cask "discord"
cask "spotify"
cask "signal"
cask "whatsapp"
cask "cog"
