tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# Dev tools
brew "git"
brew "wget"
brew "fd"
brew "ripgrep"
brew "fzf"
brew "jq"
brew "yq"
brew "tree"
brew "openssl@3"
brew "readline"
brew "libpq"
brew "mkcert"

# Terminal utilities
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "neovim"
brew "asdf"
brew "awscli"

# Fonts
cask "font-commit-mono-nerd-font"

# Apps
cask "iterm2"
# cask "docker"
# cask "visual-studio-code"

# Browsers
# cask "google-chrome"
# cask "firefox"

# Security
# cask "lulu"
# cask "1password"
# cask "clearvpn"

# Social / comms / media
# cask "discord"
# cask "spotify"
# cask "signal"
# cask "whatsapp"
# cask "cog"
